text/chart_style/c1_puts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>チャート式Ruby class[1] puts</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">チャート式Ruby class[1] puts</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7c1707c">1. イントロ</a>
<ul>
<li><a href="#org67c7c0c">1.1. 目的</a></li>
<li><a href="#org52b2ca0">1.2. 作業手順</a></li>
<li><a href="#org40aab2c">1.3. 内容のformatについて</a></li>
</ul>
</li>
<li><a href="#org533dd14">2. puts hello_world</a>
<ul>
<li><a href="#orgbc94f2a">2.1. お題</a></li>
<li><a href="#orga2c6a70">2.2. 解説</a></li>
<li><a href="#org06bb942">2.3. 詳しい解法</a></li>
<li><a href="#orgdd24225">2.4. 類題</a></li>
</ul>
</li>
<li><a href="#org0fafb7c">3. getsなんだけど，ARGV[0]で行きます！</a>
<ul>
<li><a href="#orgf2f691c">3.1. お題</a></li>
<li><a href="#org0ddeb79">3.2. 簡単な解説</a></li>
<li><a href="#org324c7c9">3.3. 詳しい解法</a></li>
<li><a href="#org8faaaf8">3.4. 類題</a></li>
</ul>
</li>
<li><a href="#org755346a">4. ここで習った項目</a></li>
<li><a href="#org3130462">5. 補足</a>
<ul>
<li><a href="#org2c507d1">5.1. powershellでgitを使う</a></li>
<li><a href="#orgb757c95">5.2. org_format</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7c1707c" class="outline-2">
<h2 id="org7c1707c"><span class="section-number-2">1</span> イントロ</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org67c7c0c" class="outline-3">
<h3 id="org67c7c0c"><span class="section-number-3">1.1</span> 目的</h3>
<div class="outline-text-3" id="text-1-1">
<p>
shell, emacs, rubyを一度に覚えてもらいます．
rubyという言語がshellという環境でどれだけ有益かを実感してもらうためです．
また，emacsとshellのkey bindingの統一性を知ることで，
達人プログラマの作業効率がなぜ良いかをわかってもらうためです．
</p>
</div>
</div>

<div id="outline-container-org52b2ca0" class="outline-3">
<h3 id="org52b2ca0"><span class="section-number-3">1.2</span> 作業手順</h3>
<div class="outline-text-3" id="text-1-2">
<p>
このテキストの構成は
</p>
<ul class="org-ul">
<li>お題</li>
<li>簡単な解説</li>
<li>詳しい解法</li>
<li>類題</li>
</ul>
<p>
となっています．
それぞれの記述に従って作業を進めれば，その内容が理解できるはずです．
</p>

<p>
ここで，忘れないための工夫をしてください．
</p>
<ul class="org-ul">
<li>参照しやすいように同じ構成</li>
<li>題目に内容をわかりやく説明した文言をつける</li>
<li>詳しい解法はくどいかもしれませんが，テスト駆動を意識しています</li>
<li>自分で作った回答をincludeして自分のできを評価してください</li>
<li>わからない内容や単語は自分で調べてテキストに書き加えるようにしてください．</li>
<li>翌週にformatして出力しましょう．それで独自のテキストが出来上がります．</li>
</ul>
</div>
</div>

<div id="outline-container-org40aab2c" class="outline-3">
<h3 id="org40aab2c"><span class="section-number-3">1.3</span> 内容のformatについて</h3>
<div class="outline-text-3" id="text-1-3">
<p>
このテキストでは，shellでの入力とsource codeをemacsとかで打ち込むのを区別しています．
</p>
<pre class="example">
&gt; cat hello.rb
</pre>
<p>
こういう感じで，command prompt(&gt;)をつけているのはshell入力を意図しています．
その出力は普通plain textですが，
</p>
<div class="org-src-container">
<pre class="src src-ruby">puts <span style="font-style: italic;">"Hello world."</span>
</pre>
</div>
<p>
という感じで，rubyのsource codeみたいに出力させています．
</p>
</div>
</div>
</div>

<div id="outline-container-org533dd14" class="outline-2">
<h2 id="org533dd14"><span class="section-number-2">2</span> puts hello_world</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbc94f2a" class="outline-3">
<h3 id="orgbc94f2a"><span class="section-number-3">2.1</span> お題</h3>
<div class="outline-text-3" id="text-2-1">
<p>
まずはhello_worldですね．
</p>
<pre class="example">
Hello world.
</pre>
<p>
と打ち出すプログラムを作ります．
</p>
</div>
</div>
<div id="outline-container-orga2c6a70" class="outline-3">
<h3 id="orga2c6a70"><span class="section-number-3">2.2</span> 解説</h3>
<div class="outline-text-3" id="text-2-2">
<p>
rubyでStringsを打ち出すのにはいくつかの方法があります．
どれを使ってもいいですし，rubyistは状況に応じて全てを使います．
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">method</th>
<th scope="col" class="org-left">使用状況</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">print</td>
<td class="org-left">普通に使う．要改行</td>
</tr>

<tr>
<td class="org-left">puts</td>
<td class="org-left">次に普通に使う. 自動改行</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">codingの最中にdebugがわりに打ち出すとき</td>
</tr>

<tr>
<td class="org-left">pp</td>
<td class="org-left">pのpretty print, require 'pp'が必要</td>
</tr>

<tr>
<td class="org-left">printf</td>
<td class="org-left">cのがあります．formatを整えるときに便利</td>
</tr>
</tbody>
</table>
<p>
そのほかにもいくつもありますが，まずはこれを覚えましょう．
</p>

<p>
Stringはシングルコーテーション'で囲うのと，
ダブルで囲うのの二種類があります．
シングルは中身をいじらないとき，ダブル"はちょこちょこいじるときです．
これは後で見て行きます．
</p>
</div>
</div>

<div id="outline-container-org06bb942" class="outline-3">
<h3 id="org06bb942"><span class="section-number-3">2.3</span> 詳しい解法</h3>
<div class="outline-text-3" id="text-2-3">
<p>
まずはシングルで囲って，
</p>
<div class="org-src-container">
<pre class="src src-ruby">puts <span style="font-style: italic;">'hello world'</span>
</pre>
</div>
<p>
を試しましょう．
</p>
<pre class="example">
&gt; mkdir codes
&gt; cd codes
&gt; emacs puts_hello_world.rb
</pre>
<p>
としてemacsを開いてcodeを打ち込んでください．c-x c-sでsaveしたらc-zで一時中断して，
</p>
<pre class="example">
&gt; ruby puts_hello_world.rb
</pre>
<p>
として走らせて見てください．動いた？
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>puts_hello_world.rb</label><pre class="src src-ruby">puts <span style="font-style: italic;">'hello world'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd24225" class="outline-3">
<h3 id="orgdd24225"><span class="section-number-3">2.4</span> 類題</h3>
<div class="outline-text-3" id="text-2-4">
<p>
pとかprintとかも試して見てください．
違いを観察して，#でコメントをつけて
p_print_hello_world.rbに書きなさい．
</p>
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>p_print_hello_world.rb</label><pre class="src src-ruby">
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">start here for p and pp</span>
p
pp

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0fafb7c" class="outline-2">
<h2 id="org0fafb7c"><span class="section-number-2">3</span> getsなんだけど，ARGV[0]で行きます！</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf2f691c" class="outline-3">
<h3 id="orgf2f691c"><span class="section-number-3">3.1</span> お題</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
&gt; ruby hello_name.rb Rudy
</pre>
<p>
と打ち込んだ時に，
</p>
<pre class="example">
Hello Rudy.
</pre>
<p>
と返ってくるcodeを書け．
</p>
</div>
</div>
<div id="outline-container-org0ddeb79" class="outline-3">
<h3 id="org0ddeb79"><span class="section-number-3">3.2</span> 簡単な解説</h3>
<div class="outline-text-3" id="text-3-2">
<p>
putsしたら普通はgetsなんですが，目的の一つであるshell環境では
command line interfaceで作業をするために
ARGV[0]というのを使って行きます．
</p>
<div class="org-src-container">
<pre class="src src-ruby">puts <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0]
</pre>
</div>
<p>
とhello_name.rbに打ち込んで，
</p>
<pre class="example">
&gt; ruby hello_name.rb Rudy
</pre>
<p>
としてください．どうよ? うちの愛犬の名前は出たやろか？
</p>
<p>
puts ARGV[0]
</p>

<p>
ARGV[0]というのは引数(argument)配列の0番目を意味しています．
unix shell上ではcommandにoptionなんかの引数を直接渡すのが普通です．
そのためにARGVというのは普通に用意されています．
</p>

<p>
次に"Hello Rudy."と打ち出させることをかんがえます．これをするにはいくつかの方法があります．
これもいろいろ試して見てください．
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">puts</td>
<td class="org-left">puts "Hello " + ARGV[0]</td>
</tr>

<tr>
<td class="org-left">puts</td>
<td class="org-left">puts "Hello #{ARGV[0]}"</td>
</tr>

<tr>
<td class="org-left">print</td>
<td class="org-left">print "Hello #{ARGV[0]}\n"</td>
</tr>

<tr>
<td class="org-left">print</td>
<td class="org-left">print "Hello " + ARGV[0] + "\n"</td>
</tr>
</tbody>
</table>

<p>
Cからの人は，printfもありです．
</p>
<div class="org-src-container">
<pre class="src src-ruby">printf(<span style="font-style: italic;">"Hello %s.\n"</span>, <span style="font-weight: bold; text-decoration: underline;">ARGV</span>[0])
</pre>
</div>
<p>
でも慣れてくると冗長なんで使わなくなります．
多分使うのは，数値計算の出力formatを揃えたいときぐらいでしょうね．
</p>
</div>
</div>

<div id="outline-container-org324c7c9" class="outline-3">
<h3 id="org324c7c9"><span class="section-number-3">3.3</span> 詳しい解法</h3>
<div class="outline-text-3" id="text-3-3">
<p>
まずは動作させて見ます．
</p>
<pre class="example">
&gt; ruby hello_name.rb Rudy
Rudy
</pre>
<p>
って返ってます？　これを変更します．
</p>
<pre class="example">
&gt; ps
</pre>
<p>
でemacsが今どういう状態かを確認して，fgあるいはemacs hell_name.rbで
起動します．
</p>
<div class="org-src-container">
<pre class="src src-ruby">puts <span style="font-style: italic;">"Hello </span><span style="font-weight: bold; font-style: italic;">#{ARGV[0]}</span><span style="font-style: italic;">"</span>
</pre>
</div>
<p>
がこういう状況ではよく使われます．
ちゃんとでています？
</p>
</div>
</div>

<div id="outline-container-org8faaaf8" class="outline-3">
<h3 id="org8faaaf8"><span class="section-number-3">3.4</span> 類題</h3>
<div class="outline-text-3" id="text-3-4">
<p>
次に"Hello Rudy."というのをどこかへ保存することを考えます．
</p>
<pre class="example">
ruby hello_name.rb bob &gt; hello_name.txt

</pre>
<p>
としてhello_name.txtに自分への挨拶を出力させて見てください．
Ruby
</p>
<pre class="example">
Hello bob.

</pre>
<p>
とかね．
'&gt;'は，出力先を指定したtxtに変更(re-direct)するshellの機能です．
</p>

<pre class="example">
cat hello_name.txt

</pre>
<p>
で中身をcat(con-cat-inate)できます．
</p>
</div>
</div>
</div>

<div id="outline-container-org755346a" class="outline-2">
<h2 id="org755346a"><span class="section-number-2">4</span> ここで習った項目</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>ruby
<ul class="org-ul">
<li>puts, print, p, pp</li>
<li>ARGV[0]</li>
</ul></li>
<li>emacs
<ul class="org-ul">
<li>C-z, C-x C-s, C-x C-c</li>
<li>ps : process status</li>
<li>fg : 一度中断したprocessを再度起動させる</li>
</ul></li>
<li>shell 
<ul class="org-ul">
<li>mkdir, cd</li>
<li>cat</li>
<li>redirection(&gt;)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3130462" class="outline-2">
<h2 id="org3130462"><span class="section-number-2">5</span> 補足</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org2c507d1" class="outline-3">
<h3 id="org2c507d1"><span class="section-number-3">5.1</span> powershellでgitを使う</h3>
<div class="outline-text-3" id="text-5-1">
<p>
以下でできそうです．試して見てください．
<a href="https://qiita.com/kerobot/items/78372640127771f92ee0">https://qiita.com/kerobot/items/78372640127771f92ee0</a>
でも，rubyとかemacsとかは動かないか．．．
sayも通らない．
</p>
</div>
</div>

<div id="outline-container-orgb757c95" class="outline-3">
<h3 id="orgb757c95"><span class="section-number-3">5.2</span> org_format</h3>
<div class="outline-text-3" id="text-5-2">
<p>
みたいなのないかな．
例えば，f.printするときに自動で，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">+begin_example</span>

<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">+end_example</span>
</pre>
</div>
<p>
をつけてくれる．とか．．．
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
